1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?

надеюсь понять зачем оно мне надо, и заменит ли мне оно эклсель - полностью не заменит, но что-то полезное вдруг придумается.

2) В какой сфере работаете сейчас?

Работаю в театре, осветителем - это типа светло на сцене, а во время концерта оно так темно темно темно, а потом бдыщь и все ослепли и куча дыма

3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?

нет такого опыта, только тут учусь